---
kind: method
id: M:Autodesk.Revit.DB.Architecture.Railing.Flip
zh: 栏杆
source: html/ad8cbb52-9732-6aaf-1187-1731f6116e81.htm
---
# Autodesk.Revit.DB.Architecture.Railing.Flip Method

**中文**: 栏杆

Flips the railing.

## Syntax (C#)
```csharp
public void Flip()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - The railing has incorrect internal data.